<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[Squirrel Cave]]></title><description><![CDATA[Thoughts, stories and ideas.]]></description><link>https://squirrelcave.com/</link><image><url>https://squirrelcave.com/favicon.png</url><title>Squirrel Cave</title><link>https://squirrelcave.com/</link></image><generator>Ghost 5.2</generator><lastBuildDate>Sun, 19 Jun 2022 15:32:28 GMT</lastBuildDate><atom:link href="https://squirrelcave.com/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[秒祝父亲节快乐背后的礼物]]></title><description><![CDATA[<blockquote> &#x4EBA;&#x58F0;&#x9F0E;&#x6CB8;&#x662F;&#x6211;&#x7684;&#x753B;&#x5E03;&#xFF0C; &#x76EE;&#x53CA;&#x6240;&#x5904;&#x662F;&#x6211;&#x7684;&#x4E16;&#x754C;&#xFF0C; &#x5FC3;&#x4E4B;&#x5411;&#x5F80;&#x662F;&#x6211;&#x7684;&#x7559;&#x767D;&#x3002;</blockquote><p>&#x201C;&#x7238;&#xFF01;&#x7236;&#x4EB2;&#x8282;&#x5FEB;&#x4E50;&#x201D; 5&#x4E2A;&#x5B57;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x86CB;&#x7CD5;&#x8868;&#x60C5;</p>]]></description><link>https://squirrelcave.com/lala/</link><guid isPermaLink="false">629b9648ed697e00019e42b5</guid><dc:creator><![CDATA[Shia L]]></dc:creator><pubDate>Sun, 19 Jun 2022 15:30:02 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1649300892935-5bb48d057e7e?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDE2fHxmYXRoZXIlMjdzJTIwZGF5fGVufDB8fHx8MTY1NTY0OTkxMg&amp;ixlib=rb-1.2.1&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<blockquote> &#x4EBA;&#x58F0;&#x9F0E;&#x6CB8;&#x662F;&#x6211;&#x7684;&#x753B;&#x5E03;&#xFF0C; &#x76EE;&#x53CA;&#x6240;&#x5904;&#x662F;&#x6211;&#x7684;&#x4E16;&#x754C;&#xFF0C; &#x5FC3;&#x4E4B;&#x5411;&#x5F80;&#x662F;&#x6211;&#x7684;&#x7559;&#x767D;&#x3002;</blockquote><img src="https://images.unsplash.com/photo-1649300892935-5bb48d057e7e?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDE2fHxmYXRoZXIlMjdzJTIwZGF5fGVufDB8fHx8MTY1NTY0OTkxMg&amp;ixlib=rb-1.2.1&amp;q=80&amp;w=2000" alt="&#x79D2;&#x795D;&#x7236;&#x4EB2;&#x8282;&#x5FEB;&#x4E50;&#x80CC;&#x540E;&#x7684;&#x793C;&#x7269;"><p>&#x201C;&#x7238;&#xFF01;&#x7236;&#x4EB2;&#x8282;&#x5FEB;&#x4E50;&#x201D; 5&#x4E2A;&#x5B57;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x86CB;&#x7CD5;&#x8868;&#x60C5;&#x5305;&#x518D;&#x52A0;&#x4E0A;&#x8BCD;&#x6839;&#x8054;&#x60F3;&#x901F;&#x6210;&#x952E;&#xFF0C;&#x4E0D;&#x5230;5&#x79D2;&#x8FD9;&#x6761;&#x795D;&#x798F;&#x4FE1;&#x606F;&#x5C31;&#x5728;&#x6211;&#x4E24;&#x4E2A;&#x5927;&#x62C7;&#x6307;&#x4E4B;&#x95F4;&#x98DE;&#x79FB;&#x8DF3;&#x52A8;&#x95F4;&#x79D2;&#x795D;&#x53D1;&#x5C04;&#x3002; &#x5E73;&#x8861;&#x53CA;&#x65F6;&#x5FEB;&#x611F;&#x80CC;&#x540E;&#x90FD;&#x662F;&#x8981;&#x9677;&#x5165;&#x65E0;&#x610F;&#x8BC6;&#x7684;&#x7A7A;&#x65E0;&#x65F6;&#x523B;&#xFF0C;&#x53BB;&#x53CA;&#x65F6;&#x66F4;&#x65B0;&#x5927;&#x8111;&#x548C;&#x7075;&#x9B42;&#x7684;&#x540C;&#x6B65;&#x3002;&#x6211;&#x5728;&#x63A8;&#x7740;&#x5386;&#x53F2;&#x5E74;&#x8F6E;&#x96C6;&#x4F53;&#x987A;&#x52BF;&#x884C;&#x8D70;&#x7740;&#x65F6;&#x5019;&#xFF0C; &#x4E0D;&#x7981;&#x832B;&#x7136;&#x7684;&#x505C;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x773C;&#x775B;&#x6014;&#x6014;&#x7684;&#x770B;&#x7740;&#x5608;&#x6742;&#x62E5;&#x6324;&#x7684;&#x4EBA;&#x6D41;&#x65B9;&#x5411;&#xFF0C; &#x6211;&#x4FEF;&#x8EAB;&#x6478;&#x4E86;&#x6478;&#x8F66;&#x8F6E;&#x64B5;&#x4E0B;&#x7684;&#x8F99;&#x5370;&#x3002; &#x597D;&#x50CF;&#x542C;&#x5230;&#x6709;&#x4EBA;&#x58F0;&#x98D8;&#x6765;&#x8BF4;&#x6211;&#x843D;&#x540E;&#x4E86;&#xFF0C; &#x4F46;&#x662F;&#x6B64;&#x65F6;&#x7684;&#x6211;&#x5145;&#x8033;&#x4E0D;&#x95FB;&#xFF0C; &#x53EA;&#x987E;&#x50BB;&#x50BB;&#x7684;&#x770B;&#x7740;&#x8FD9;&#x4E9B;&#x6DF7;&#x5408;&#x7740;&#x5404;&#x8272;&#x6CE5;&#x571F;&#x5947;&#x5F62;&#x602A;&#x72B6;&#x7684;&#x6761;&#x5F62;&#x7801;&#x3002;&#x626A;&#x5FC3;&#x81EA;&#x95EE;&#x7740;&#xFF1A;&#x6211;&#x662F;&#x8C01;&#xFF1F; &#x6211;&#x5728;&#x54EA;&#xFF1F; &#x6211;&#x60F3;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;&#x6211;&#x60F3;&#x8981;&#x53BB;&#x54EA;&#x91CC;&#xFF1F; &#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p><p>&#x6211;&#x5F00;&#x59CB;&#x9677;&#x5165;&#x6C89;&#x601D; &#x6211;&#x5F00;&#x59CB;&#x626A;&#x5FC3;&#x81EA;&#x95EE;&#xFF1A;&#x4EBA;&#x7C7B;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6838;&#x5FC3;&#x60C5;&#x611F;&#x7EF4;&#x7CFB;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53D8;&#x5F97;&#x8FD9;&#x6837;&#x901F;&#x6210;&#xFF1F; &#x6309;&#x7167;&#x5B88;&#x6052;&#x5B9A;&#x5F8B;&#x3002; &#x901F;&#x6210;&#x60C5;&#x611F;&#x662F;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x968F;&#x65F6;&#x90FD;&#x80FD;&#x652F;&#x79BB;&#x7834;&#x788E;&#x8F6C;&#x5316;&#x6210;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x548C;&#x80FD;&#x91CF;&#x3002;&#x987A;&#x5E94;&#x8D8B;&#x52BF;&#x7684;&#x6211;&#x4EEC;&#x90FD;&#x751F;&#x6D3B;&#x4E00;&#x4E2A;&#x5728;&#x9AD8;&#x901F;&#x8FD0;&#x8425;&#x7684;&#x7535;&#x5B50;&#x4FE1;&#x606F;&#x65F6;&#x4EE3;&#x91CC;&#xFF0C;&#x4ECE;&#x6E05;&#x89C4;&#x6212;&#x5F8B;&#x7684;&#x5E99;&#x5B87;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x5934;&#x76EE;&#x7684;&#x529E;&#x516C;&#x533A;&#x91CC;&#x6BCF;&#x4E00;&#x4E2A;&#x793E;&#x533A;&#x5C0F;&#x5355;&#x5143;&#x91CC;&#x6211;&#x4EEC;&#x90FD;&#x5728;&#x65F6;&#x4EE3;&#x53D1;&#x5C55;&#x91CC;&#x88AB;&#x88F9;&#x631F;&#x524D;&#x8FDB;&#x7740;&#x3002; &#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x793E;&#x4F1A;&#x4EBA;&#x80FD;&#x6D3B;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x5C9B;&#x5C7F;&#x3002; </p><p>&#x81EA;&#x6253;90&#x5E74;&#x4EE3;&#x521D;&#x4E92;&#x8054;&#x7F51;&#x5F00;&#x59CB;&#x8D70;&#x8FDB;&#x4E2D;&#x56FD;&#x7684;&#x7F51;&#x5427;&#xFF0C;&#x4E00;&#x76F4;&#x5230;2022&#x5E74;&#x4ECA;&#x5929;&#x4F9D;&#x7136;&#x6B63;&#x5728;&#x84C4;&#x52BF;&#x6539;&#x53D8;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x65B9;&#x5F0F;&#x3002;&#x770B;&#x4F3C;&#x4E92;&#x8054;&#x7F51;&#x6E17;&#x900F;&#x5230;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x7684;&#x6D6A;&#x6F6E;&#x524D;&#x6D6A;&#x63A8;&#x540E;&#x6D6A;&#xFF0C; &#x6D6E;&#x4E8B;&#x65B0;&#x4EBA;&#x6362;&#x65E7;&#x4EBA;&#x3002; &#x4F46;&#x5B9E;&#x8D28;&#x8FD8;&#x662F;&#x4FE1;&#x606F;&#x7684;&#x4F20;&#x64AD;&#x65B9;&#x5F0F;&#xFF0C;&#x901F;&#x5EA6;&#x662F;&#x4F20;&#x64AD;&#x7684;&#x5173;&#x952E;&#x53D8;&#x91CF;&#x3002; &#x4ECE;&#x53E4;&#x4EE3;&#x6700;&#x9AD8;&#x7B49;&#x7EA7;&#x7684;&#x516B;&#x767E;&#x91CC;&#x9A6C;&#x4E0D;&#x505C;&#x8E44;24&#x4E2A;&#x5C0F;&#x65F6;&#x52A0;&#x6025;&#x9001;&#x5230;&#x76F4;&#x81F3;&#x4ECA;&#x65E5;&#x79D2;&#x9001;&#x79D2;&#x56DE;&#x4E2D;&#x95F4;&#x7ECF;&#x8FC7;&#x591A;&#x5C11;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x8DCC;&#x66F4;&#x548C;&#x5347;&#x7EA7;&#x3002;</p><p>&#x901F;&#x6210;&#x7684;&#x611F;&#x60C5;&#x518D;&#x8584;&#x4E5F;&#x662F;&#x96F6;&#x661F;&#x5EFA;&#x8BBE;&#xFF0C;&#x53EA;&#x662F;&#x4ECE;&#x4EBA;&#x7C7B;&#x53D1;&#x5C55;&#x89D2;&#x5EA6;&#x8FD9;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x3002; &#x5982;&#x679C;&#x987A;&#x5E94;&#x80CC;&#x666F;&#x8D8B;&#x52BF;&#xFF0C;&#x90A3;&#x901F;&#x6210;&#x53E0;&#x52A0;&#x79EF;&#x7D2F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7B56;&#x7565;&#x3002;</p><p>&#x6211;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x5386;&#x53F2;&#x8F66;&#x8F6E;&#x524D;&#x8FDB;&#x7684;&#x65B9;&#x5411;&#xFF0C; &#x6211;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x65F6;&#x95F4;&#x4E00;&#x5E27;&#x4E00;&#x79D2;&#x5728;&#x5F39;&#x6307;&#x95F4;&#x6D41;&#x901D;&#x3002; &#x4E0E;&#x5176;&#x7AD9;&#x5728;&#x6865;&#x4E0A;&#x671B;&#x6D0B;&#x5174;&#x53F9;&#x8BF4;&#x7740;&#x901D;&#x8005;&#x5982;&#x65AF;&#xFF0C; &#x4E0D;&#x5982;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x8BB0;&#x5F55;&#x6211;&#x76EE;&#x5149;&#x6240;&#x53CA;&#x7684;&#x4E16;&#x754C;&#x3002; &#x6211;&#x60F3;&#x80CC;&#x501A;&#x7E41;&#x534E;&#xFF0C;&#x9690;&#x4E8E;&#x95F9;&#x5E02;&#xFF0C;&#x4E3A;&#x6709;&#x7F18;&#x8005;&#x7559;&#x4E0B;&#x70B9;&#x65F6;&#x4EE3;&#x548C;&#x751F;&#x6D3B;&#x7684;&#x86DB;&#x4E1D;&#x9A6C;&#x8FF9;&#x3002; &#x6211;&#x60F3; &#x627E;&#x5757;&#x5FC3;&#x7075;&#x7684;&#x51C0;&#x571F;&#xFF0C;&#x4E00;&#x4E2A;&#x6E29;&#x6696;&#x7684;&#x7A7A;&#x95F4;&#x53BB;&#x6253;&#x7406;&#x81EA;&#x5DF1;&#x601D;&#x7EEA;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x81EA;&#x5DF1;&#x6C89;&#x9677;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x77ED;&#x7684;&#x89C6;&#x9891;&#x548C;&#x6587;&#x5B57;&#x91CC;&#x53BB;&#x5931;&#x53BB;&#x81EA;&#x6211;&#x3002;</p><p>&#x5C31;&#x8D81;&#x7740;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x7236;&#x4EB2;&#x8282;&#x5427;&#xFF01;&#x5341;&#x5E74;&#x5F02;&#x56FD;&#x4ED6;&#x4E61;&#x7684;&#x79EF;&#x7D2F;&#x594B;&#x6597;&#x671F;&#x95F4;&#x6211;&#x548C;&#x7236;&#x4EB2;&#x5929;&#x4EBA;&#x6C38;&#x9694;&#xFF0C; &#x5F53;&#x65F6;&#x6211;&#x4EE5;&#x4E3A;&#x7236;&#x4EB2;&#x8282;&#x4ECE;&#x6B64;&#x548C;&#x6211;&#x518D;&#x65E0;&#x74DC;&#x845B;&#xFF0C; &#x53EF;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x631A;&#x7231;&#x7684;&#x4EBA;&#x751F;&#x4F34;&#x4FA3;&#xFF0C; &#x66F4;&#x56E0;&#x4E3A;2021&#x5E74;11&#x6708;&#x4E00;&#x4E2A;&#x65B0;&#x751F;&#x547D;&#x501F;&#x7740;&#x6211;&#x7684;&#x8EAB;&#x4F53;&#x5B89;&#x5168;&#x7740;&#x843D;&#x4EBA;&#x4E16;&#x95F4;&#x3002;&#x6211;&#x7684;&#x5973;&#x513F;&#x81EA;&#x6B64;&#x6709;&#x4E86;&#x5979;&#x751F;&#x547D;&#x91CC;&#x4E24;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8840;&#x4EB2;&#xFF1A;&#x7236;&#x4EB2;&#x548C;&#x7956;&#x7236;&#x3002;2022&#x5E74;&#x7684;&#x7236;&#x4EB2;&#x8282;&#x81EA;&#x6B64;&#x5F00;&#x59CB;&#x95EA;&#x70C1;&#x51FA;&#x4E86;&#x610F;&#x4E49;&#x975E;&#x51E1;&#x7684;&#x5149;&#x8F89;&#x3002; &#x6211;&#x548C;&#x961F;&#x53CB;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x96F6;&#x788E;&#x4E16;&#x95F4;&#x5F00;&#x901A;&#x4E86;&#x201C;&#x677E;&#x9F20;&#x9A7F;&#x7AD9;&#x201D;&#x535A;&#x5BA2;&#x3002;&#x4EE5;2022&#x7684;&#x7236;&#x4EB2;&#x8282;&#x4E3A;&#x5E8F;&#x7AE0;&#xFF0C; &#x5F80;&#x540E;&#x4F59;&#x751F;&#x5C31;&#x5728;&#x677E;&#x9F20;&#x9A7F;&#x7AD9;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x8FDE;&#x63A5;&#x81EA;&#x5DF1;&#xFF0C;&#x5BB6;&#x4EBA;&#x548C;&#x4E16;&#x754C;&#x3002; </p><p>&#x4EBA;&#x751F;&#x672C;&#x662F;&#x4E00;&#x672C;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#x7684;&#x4E66;&#xFF0C; &#x4EBA;&#x751F;&#x76AE;&#x56CA;&#x662F;&#x5C01;&#x76AE;&#xFF1B;&#x540D;&#x5B57;&#x548C;&#x793E;&#x4F1A;&#x5173;&#x7CFB;&#x5199;&#x5728;&#x6249;&#x9875;&#x4E0A;&#xFF1B;&#x524D;&#x8A00;&#x662F;&#x5BF9;&#x4EBA;&#x751F;&#x7684;&#x7B80;&#x4ECB;&#xFF1B;&#x4EBA;&#x751F;&#x6BCF;&#x5341;&#x5E74;&#x4FBF;&#x662F;&#x76EE;&#x5F55;&#x5F15;&#x64CE;&#xFF0C; &#x6B63;&#x6587;&#x662F;&#x516C;&#x5E73;&#x7684;&#x65F6;&#x95F4;&#x4E0A;&#x5E1D;&#x8D50;&#x4E88;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x6BCF;&#x5929;&#x7684;24&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x6BCF;&#x5206;&#x6BCF;&#x79D2;&#xFF1B;&#x9875;&#x7801;&#x5C31;&#x662F;&#x65E5;&#x5386;&#x4E0A;&#x4E00;&#x5206;&#x4E00;&#x79D2;&#x7684;&#x8BB0;&#x5F55;&#xFF1B;&#x53C2;&#x8003;&#x6587;&#x732E;&#x5219;&#x662F;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x6211;&#x4EEC;&#x4E00;&#x751F;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x548C;&#x6BCF;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;</p><p>&#x800C;&#x4ECA;&#x5929;&#x4E09;&#x5341;&#x800C;&#x7ACB;&#x4E2D;&#x7684;&#x7BC7;&#x7AE0;&#x91CC;&#x6211;&#x548C;&#x961F;&#x53CB;&#xFF1A;&#x677E;&#x9F20;&#x9A7F;&#x7AD9;&#x5F00;&#x5F20;&#x7684;&#x7B2C;&#x4E00;&#x5929;&#x6211;&#x5982;&#x662F;&#x8BF4;&#xFF1A; &#x6211;&#x662F;&#x65B0;&#x664B;&#x5B9D;&#x5988;&#xFF0C;&#x6211;&#x662F;&#x677E;&#x9F20;&#x9A7F;&#x7AD9;&#x7684;&#x5973;&#x638C;&#x67DC;&#xFF0C;&#x6211;&#x548C;&#x6211;&#x5BB6;&#x7684;&#x7537;&#x638C;&#x67DC;&#x5B89;&#x5BB6;&#x5728;&#x6CE2;&#x7279;&#x5170;&#x7684;&#x7E41;&#x534E;&#x95F9;&#x5E02;&#x4E2D;&#xFF0C; &#x6211;&#x4EEC;&#x60F3;&#x4EE5;&#x81EA;&#x5DF1;&#x611F;&#x77E5;&#x5916;&#x754C;&#x6E29;&#x5EA6;&#x7684;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x4F59;&#x751F;&#xFF0C;&#x6211;&#x60F3;&#x548C;&#x6211;&#x7231;&#x7684;&#x5C0F;&#x5C0F;&#x53EF;&#x513F;&#x548C;&#x6E29;&#x6696;&#x5982;&#x7389;&#x7684;&#x5BB6;&#x4EBA;&#x79EF;&#x6781;&#x70ED;&#x7231;&#x751F;&#x6D3B;&#x3002;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x966A;&#x4F34;&#x4E00;&#x9897;&#x65B0;&#x8BDE;&#x751F;&#x7684;&#x7AE5;&#x5FC3;&#x9A71;&#x52A8;&#x4E16;&#x754C;&#x56E0;&#x4E3A;&#x76F8;&#x6BD4;&#x4E92;&#x8054;&#x7F51;&#x50AC;&#x751F;&#x7684;&#x91CF;&#x5316;&#x4FE1;&#x606F;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x5FEB;&#x5EA6;&#x548C;&#x5E7F;&#x5EA6;&#xFF0C;&#x6211;&#x548C;&#x6211;&#x7684;&#x961F;&#x53CB;&#x66F4;&#x770B;&#x91CD;&#x751F;&#x547D;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x97E7;&#x5EA6;&#x548C;&#x6DF1;&#x5EA6;&#x3002; </p><p>&#x9ED8;&#x9ED8;&#x8015;&#x8018;<br>&#x4E0D;&#x95EE;&#x82B1;&#x5F00; <br>&#x6709;&#x8FF9;&#x53EF;&#x5FAA;&#x59CB;&#x4E8E;6/19/2022&#x7236;&#x4EB2;&#x8282;</p><p> </p><figure class="kg-card kg-image-card"><img src="https://squirrelcave.com/content/images/2022/06/IMG_5377.jpg" class="kg-image" alt="&#x79D2;&#x795D;&#x7236;&#x4EB2;&#x8282;&#x5FEB;&#x4E50;&#x80CC;&#x540E;&#x7684;&#x793C;&#x7269;" loading="lazy" width="1105" height="1600" srcset="https://squirrelcave.com/content/images/size/w600/2022/06/IMG_5377.jpg 600w, https://squirrelcave.com/content/images/size/w1000/2022/06/IMG_5377.jpg 1000w, https://squirrelcave.com/content/images/2022/06/IMG_5377.jpg 1105w" sizes="(min-width: 720px) 720px"></figure>]]></content:encoded></item><item><title><![CDATA[Happy Father's Day, Charles]]></title><description><![CDATA[<p>Happy Father&apos;s Day, Charles! Welcome to the squirrelcave parenting blog. Thank you for the push to get this going.</p><p>This blog will document Shia&apos;s and my parenting adventures with our Little Clove, and you already know we have so much we want to say. Each generation</p>]]></description><link>https://squirrelcave.com/happy-fathers-day-charles/</link><guid isPermaLink="false">62aa6de9241c9f0001244d00</guid><dc:creator><![CDATA[Xiao F]]></dc:creator><pubDate>Sun, 19 Jun 2022 13:25:11 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1610194978275-8eee57ceafdd?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDZ8fGZhdGhlcnxlbnwwfHx8fDE2NTU2NDQ3OTc&amp;ixlib=rb-1.2.1&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1610194978275-8eee57ceafdd?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDZ8fGZhdGhlcnxlbnwwfHx8fDE2NTU2NDQ3OTc&amp;ixlib=rb-1.2.1&amp;q=80&amp;w=2000" alt="Happy Father&apos;s Day, Charles"><p>Happy Father&apos;s Day, Charles! Welcome to the squirrelcave parenting blog. Thank you for the push to get this going.</p><p>This blog will document Shia&apos;s and my parenting adventures with our Little Clove, and you already know we have so much we want to say. Each generation stands on the shoulders of the last, so Little Clove&apos;s stretch back to you and Mom. I&apos;m proud to start this blog on (Grand-) Father&apos;s day, with acknowledgements to you, Dad.</p><p>Thank you, Dad, for everything you&apos;ve given me.</p><p>Thank you Dad, for laughter. Mom always said she picked you for your good-natured laugh, and you always told me a family needs the sound of laughter. My earliest memory of you is that &quot;hhwt hhwt&quot; noise you&apos;d make before tickling me. You could send me into giggles with just the anticipation, making that noise and wiggling your fingers. I am passing this tradition and these giggles on to Little Clove.</p><p>Thank you Dad, for teaching me to Be Results Oriented. It took me a while to grasp this meaning, but in today&apos;s chaotic world it gives much-needed Focus. Focus will be a foundational skill for Little Clove, and Being Results Oriented will help her stay focused in whatever endeavors she chooses.</p><p>Thank you Dad, for modeling healthy living. Your hiking-adventuring lifestyle is an inspiration. I look forward to the day when Little Clove wants to climb Camelback Mountain or cross the Grand Canyon, and I&apos;ll tell her &quot;Let&apos;s ask Grandma and Grandpa to take us!&quot;</p><p>Thank you Dad, for encouraging my exploration and curiosity. Finding an n-way solution to your two-way switch problem is still one of my proudest memories, especially as I recall your excitement opening up the house light switches to confirm. Shia and I are preparing Little Clove&apos;s environment with opportunities to disassemble and opportunities to build. Opportunities for her own &quot;Aha!&quot; moments. &#xA0;</p><p>Thank you Dad, for the support you&apos;ve given us since Mingming was born. From fish soup in the hospital, to making sure we got some sleep the first month, to helping us install our vent hood. They say it takes a village to raise a child. You and Mom have been our village so far.</p><p>Thank you Dad. You&apos;ve taught me by example to enjoy life, be active, and be a family man. I treasure your lessons and I will pass them on as family heirlooms. I treasure the foundation you&apos;ve given me. It will be Mingming&apos;s Foundation&apos;s Foundation.</p><p>Thank you Dad, I love you.</p>]]></content:encoded></item></channel></rss>